/*
 Класс одного элемента софона
 */
#ifndef C_BODY_H
#define C_BODY_H
//========================================================================
 //---------------------------- ПОДКЛЮЧАЕМЫЕ ФАЙЛЫ ------------------------
 //========================================================================
#include "cSofon.h"

 //========================================================================
 //-------------------------------- КОНСТАНТЫ -----------------------------
 //========================================================================
#define BODY_LEN 3
#define BOTTOM_EDGE 0
#define TOP_EDGE 57


 //========================================================================
 //--------------------------- ОБЪЯВЛЕНИЕ КЛАССОВ -------------------------
 //========================================================================
class cBody
{
 //------------------------------------------------------------------------
 // Атрибуты
 //------------------------------------------------------------------------
  bool Direction = true;
  int Head;
  int Len = BODY_LEN;
  int Bones[BODY_LEN];  

 //------------------------------------------------------------------------
 // Методы
 //------------------------------------------------------------------------
  void blank();
  void draw();
  void goDown();
  void goUp();

public:

 //------------------------------------------------------------------------
 // Конструктор
 //------------------------------------------------------------------------
  cBody();
  
 //------------------------------------------------------------------------
 // Методы
 //------------------------------------------------------------------------
 void install(int x, bool d);
 void move();
};

cBody::cBody()
{
  //...
}

void cBody::move()
{
  Direction ? goUp() : goDown();
}

void cBody::goUp()
{
    blank();
    Head++;
    if(Head == TOP_EDGE) Direction = !Direction;
    Bones[0] = Head;
    Bones[1] = Head + 1;
    Bones[2] = Head + 2;
    draw(); 
}

void cBody::goDown()
{
  blank();
  Head--;
  if(Head == BOTTOM_EDGE) Direction = !Direction;
  Bones[0] = Head;
  Bones[1] = Head + 1;
  Bones[2] = Head + 2;
  draw();  
}

void cBody::draw()
{
  Sofon.Field[Bones[0]] = true;
  Sofon.Field[Bones[1]] = true;
  Sofon.Field[Bones[2]] = true;
}

void cBody::blank()
{
  Sofon.Field[Bones[0]] = false;
  Sofon.Field[Bones[1]] = false;
  Sofon.Field[Bones[2]] = false;
}

void cBody::install(int x, bool d)
{
  Head = x;
  Direction = d;
  
  Bones[0] = Head;
  Bones[1] = Head + 1;
  Bones[2] = Head + 2;

  draw();
}

#endif
