//----------------------------------------------------------------
// Подключаемые файлы
//----------------------------------------------------------------
#include "cTiming.h"
#include "cBody.h"

//----------------------------------------------------------------
// Константы
//----------------------------------------------------------------
#define START_DELAY 1000
//#define DELAY_1 20
#define DELAY_1 2
//#define DELAY_1 100


//----------------------------------------------------------------
// Глобальные переменные
//----------------------------------------------------------------
cBody Body1;
cBody Body2;
//----------------------------------------------------------------
// Программа начальной установки
//----------------------------------------------------------------
void setup() 
{
  Sofon.install(DELAY_1, NUMPIXELS / 2, 0, 0, 150);
  delay(START_DELAY);

  Body1.born(NUMPIXELS / 2 + 5, true, 0);
  Body2.born((NUMPIXELS / 2) - 5, true, 1);
}

//----------------------------------------------------------------
// Главный цикл программы
//----------------------------------------------------------------
void loop() 
{
  Sofon.operate();
  if(Sofon.IsFinish)
  {
    Sofon.IsFinish = false;

    Body1.move();
    Body1.transform();
    Body2.move();
    Body2.transform();
  }
} 
